XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/std_drv/inc/bl606p_sdh.h
/** @defgroup  SDH_DATA_BUS_WIDTH_TYPE
 *  @{
 */
#define IS_SDH_DATA_BUS_WIDTH_TYPE(type) (((type) == SDH_DATA_BUS_WIDTH_1BIT) ||  \
                                          ((type) == SDH_DATA_BUS_WIDTH_4BITS) || \
                                          ((type) == SDH_DATA_BUS_WIDTH_8BITS))

/** @defgroup  SDH_VOLTAGE_TYPE
 *  @{
 */
#define IS_SDH_VOLTAGE_TYPE(type) (((type) == SDH_VOLTAGE_3P3V) || \
                                   ((type) == SDH_VOLTAGE_3P0V) || \
                                   ((type) == SDH_VOLTAGE_1P8V))

/** @defgroup  SDH_DMA_MODE_TYPE
 *  @{
 */
#define IS_SDH_DMA_MODE_TYPE(type) (((type) == SDH_DMA_MODE_SIMPLE) || \
                                    ((type) == SDH_DMA_MODE_ADMA1) ||  \
                                    ((type) == SDH_DMA_MODE_ADMA2))

/** @defgroup  SDH_CTRL_FLAG_TYPE
 *  @{
 */
#define IS_SDH_CTRL_FLAG_TYPE(type) (((type) == SDH_CTRL_FLAG_STOP_AT_BLK_GAP) ||         \
                                     ((type) == SDH_CTRL_FLAG_READ_WAIT) ||               \
                                     ((type) == SDH_CTRL_FLAG_INT_AT_BLK_GAP) ||          \
                                     ((type) == SDH_CTRL_FLAG_RAED_DONE_WITHOUT_8CLKS) || \
                                     ((type) == SDH_CTRL_FLAG_EXACT_BLK_NUM_READ))

/** @defgroup  SDH_CMD_TYPE
 *  @{
 */
#define IS_SDH_CMD_TYPE(type) (((type) == SDH_CMD_NORMAL) ||  \
                               ((type) == SDH_CMD_SUSPEND) || \
                               ((type) == SDH_CMD_RESUME) ||  \
                               ((type) == SDH_CMD_ABORT) ||   \
                               ((type) == SDH_CMD_EMPTY))

/** @defgroup  SDH_RESP_TYPE
 *  @{
 */
#define IS_SDH_RESP_TYPE(type) (((type) == SDH_RESP_NONE) || \
                                ((type) == SDH_RESP_R1) ||   \
                                ((type) == SDH_RESP_R1B) ||  \
                                ((type) == SDH_RESP_R2) ||   \
                                ((type) == SDH_RESP_R3) ||   \
                                ((type) == SDH_RESP_R4) ||   \
                                ((type) == SDH_RESP_R5) ||   \
                                ((type) == SDH_RESP_R5B) ||  \
                                ((type) == SDH_RESP_R6) ||   \
                                ((type) == SDH_RESP_R7))

/** @defgroup  SDH_ADMA_FLAG_TYPE
 *  @{
 */
#define IS_SDH_ADMA_FLAG_TYPE(type) (((type) == SDH_ADMA_FLAG_SINGLE_DESC) || \
                                     ((type) == SDH_ADMA_FLAG_MULTI_DESC))

/** @defgroup  SDH_ADMA1_DESC_FLAG_TYPE
 *  @{
 */
#define IS_SDH_ADMA1_DESC_FLAG_TYPE(type) (((type) == SDH_ADMA1_DESC_FLAG_VALID) ||    \
                                           ((type) == SDH_ADMA1_DESC_FLAG_END) ||      \
                                           ((type) == SDH_ADMA1_DESC_FLAG_INT) ||      \
                                           ((type) == SDH_ADMA1_DESC_FLAG_ACTIVE1) ||  \
                                           ((type) == SDH_ADMA1_DESC_FLAG_ACTIVE2) ||  \
                                           ((type) == SDH_ADMA1_DESC_FLAG_TRANSFER) || \
                                           ((type) == SDH_ADMA1_DESC_FLAG_LINK) ||     \
                                           ((type) == SDH_ADMA1_DESC_FLAG_SETLEN))

/** @defgroup  SDH_ADMA2_DESC_FLAG_TYPE
 *  @{
 */
#define IS_SDH_ADMA2_DESC_FLAG_TYPE(type) (((type) == SDH_ADMA2_DESC_FLAG_VALID) ||    \
                                           ((type) == SDH_ADMA2_DESC_FLAG_END) ||      \
                                           ((type) == SDH_ADMA2_DESC_FLAG_INT) ||      \
                                           ((type) == SDH_ADMA2_DESC_FLAG_ACTIVE1) ||  \
                                           ((type) == SDH_ADMA2_DESC_FLAG_ACTIVE2) ||  \
                                           ((type) == SDH_ADMA2_DESC_FLAG_TRANSFER) || \
                                           ((type) == SDH_ADMA2_DESC_FLAG_LINK))

/** @defgroup  SDH_BURST_TYPE
 *  @{
 */
#define IS_SDH_BURST_TYPE(type) (((type) == SDH_BUSRT_INCR) ||  \
                                 ((type) == SDH_BUSRT_INCR4) || \
                                 ((type) == SDH_BUSRT_WRAP4))

/** @defgroup  SDH_FIFO_THRESHOLD_TYPE
 *  @{
 */
#define IS_SDH_FIFO_THRESHOLD_TYPE(type) (((type) == SDH_FIFO_THRESHOLD_64_BYTES) ||  \
                                          ((type) == SDH_FIFO_THRESHOLD_128_BYTES) || \
                                          ((type) == SDH_FIFO_THRESHOLD_192_BYTES) || \
                                          ((type) == SDH_FIFO_THRESHOLD_256_BYTES))

/** @defgroup  SDH_BURST_SIZE_TYPE
 *  @{
 */
#define IS_SDH_BURST_SIZE_TYPE(type) (((type) == SDH_BURST_SIZE_32_BYTES) ||  \
                                      ((type) == SDH_BURST_SIZE_64_BYTES) ||  \
                                      ((type) == SDH_BURST_SIZE_128_BYTES) || \
                                      ((type) == SDH_BURST_SIZE_256_BYTES))

/** @defgroup  SDH_TRANS_DATA_TYPE
 *  @{
 */
#define IS_SDH_TRANS_DATA_TYPE(type) (((type) == SDH_TRANS_DATA_NORMAL) || \
                                      ((type) == SDH_TRANS_DATA_TUNING) || \
                                      ((type) == SDH_TRANS_DATA_BOOT) ||   \
                                      ((type) == SDH_TRANS_DATA_BOOT_CONT))

/*@} end of group SDH_Public_Constants */

/** @defgroup  SDH_Public_Macros
 *  @{
 */
/* The alignment size for ADDRESS filed in SDMA */
#define SDH_SDMA_ADDRESS_ALIGN (1U)
/* The alignment size for LENGTH field in SDMA */
#define SDH_SDMA_LENGTH_ALIGN (1U)
/* The alignment size for ADDRESS filed in ADMA1's descriptor */
#define SDH_ADMA1_ADDRESS_ALIGN (4096U)
/* The alignment size for ADDRESS field in ADMA2's descriptor */
#define SDH_ADMA2_ADDRESS_ALIGN (1U)
/* The alignment size for LENGTH filed in ADMA2's descriptor */
#define SDH_ADMA2_LENGTH_ALIGN (1U)
/* ADMA1 descriptor table
* |------------------------|---------|--------------------------|
* | Address/page field     |Reserved |         Attribute        |
* |------------------------|---------|--------------------------|
* |31                    12|11      6|05  |04  |03|02 |01 |00   |
* |------------------------|---------|----|----|--|---|---|-----|
* | address or data length | 000000  |Act2|Act1| 0|Int|End|Valid|
* |------------------------|---------|----|----|--|---|---|-----|
*
*
* |------|------|-----------------|-------|-------------|
* | Act2 | Act1 |     Comment     | 31-28 | 27 - 12     |
* |------|------|-----------------|---------------------|
* |   0  |   0  | No op           | Don't care          |
* |------|------|-----------------|-------|-------------|
* |   0  |   1  | Set data length |  0000 | Data Length |
* |------|------|-----------------|-------|-------------|
* |   1  |   0  | Transfer data   | Data address        |
* |------|------|-----------------|---------------------|
* |   1  |   1  | Link descriptor | Descriptor address  |
* |------|------|-----------------|---------------------|
*/
/* The bit shift for ADDRESS filed in ADMA1's descriptor */
#define SDH_ADMA1_DESCRIPTOR_ADDRESS_POS (12U)
/* The bit mask for ADDRESS field in ADMA1's descriptor */
#define SDH_ADMA1_DESCRIPTOR_ADDRESS_MASK (0xFFFFFU)
/* The bit shift for LENGTH filed in ADMA1's descriptor */
#define SDH_ADMA1_DESCRIPTOR_LENGTH_POS (12U)
/* The mask for LENGTH field in ADMA1's descriptor */
#define SDH_ADMA1_DESCRIPTOR_LENGTH_MASK (0xFFFFU)
/* The maximum value of LENGTH filed in ADMA1's descriptor */
#define SDH_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY (SDH_ADMA1_DESCRIPTOR_LENGTH_MASK - 3U)
/* ADMA2 descriptor table
* |----------------|---------------|-------------|--------------------------|
* | Address field  |     Length    | Reserved    |         Attribute        |
* |----------------|---------------|-------------|--------------------------|
* |63            32|31           16|15         06|05  |04  |03|02 |01 |00   |
* |----------------|---------------|-------------|----|----|--|---|---|-----|
* | 32-bit address | 16-bit length | 0000000000  |Act2|Act1| 0|Int|End|Valid|
* |----------------|---------------|-------------|----|----|--|---|---|-----|
*
*
* | Act2 | Act1 |     Comment     | Operation                                                         |
* |------|------|-----------------|-------------------------------------------------------------------|
* |   0  |   0  | No op           | Don't care                                                        |
* |------|------|-----------------|-------------------------------------------------------------------|
* |   0  |   1  | Reserved        | Read this line and go to next one                                 |
* |------|------|-----------------|-------------------------------------------------------------------|
* |   1  |   0  | Transfer data   | Transfer data with address and length set in this descriptor line |
* |------|------|-----------------|-------------------------------------------------------------------|
* |   1  |   1  | Link descriptor | Link to another descriptor                                        |
* |------|------|-----------------|-------------------------------------------------------------------|
*/
/* The bit shift for LENGTH field in ADMA2's descriptor */
#define SDH_ADMA2_DESCRIPTOR_LENGTH_POS (16U)
/* The bit mask for LENGTH field in ADMA2's descriptor */
#define SDH_ADMA2_DESCRIPTOR_LENGTH_MASK (0xFFFFU)
/* The maximum value of LENGTH field in ADMA2's descriptor */
#define SDH_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY (SDH_ADMA2_DESCRIPTOR_LENGTH_MASK - 3U)
#define SDH_EnableIntStatus(mask)                                             \
    do {                                                                      \
        BL_WR_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_EN,                      \
                  BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_EN) | (mask)); \
    } while (0)
#define SDH_DisableIntStatus(mask)                                               \
    do {                                                                         \
        BL_WR_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_EN,                         \
                  BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_EN) & (~(mask))); \
    } while (0)
#define SDH_EnableIntSource(mask)                                                 \
    do {                                                                          \
        BL_WR_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_INT_EN,                      \
                  BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_INT_EN) | (mask)); \
    } while (0)
#define SDH_DisableIntSource(mask)                                                   \
    do {                                                                             \
        BL_WR_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_INT_EN,                         \
                  BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_INT_EN) & (~(mask))); \
    } while (0)
#define SDH_GetIntStatus()       BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS);
#define SDH_GetIntEnableStatus() BL_RD_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS_INT_EN);
#define SDH_ClearIntStatus(mask) BL_WR_REG(SDH_BASE, SDH_SD_NORMAL_INT_STATUS, (mask));
#define SDH_AutoCmd12ErrStatus() BL_RD_SHORT(SDH_BASE + SDH_SD_AUTO_CMD12_ERROR_STATUS_OFFSET);
#define SDH_GetDMAErrStatus()    BL_RD_SHORT(SDH_BASE + SDH_SD_ADMA_ERROR_STATUS_OFFSET);
#define SDH_GetPresentStatus()   BL_RD_REG(SDH_BASE, SDH_SD_PRESENT_STATE_1);
#define SDH_MAX_BLOCK_COUNT      0xffff
//#define SDH_CMD_INDEX(x)                    (x)

/*@} end of group SDH_Public_Macros */

/** @defgroup  SDH_Public_Functions
 *  @{
 */
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
void SDH_MMC1_IRQHandler(void);
#endif
void SDH_Reset(void);
void SDH_Set_Timeout(uint8_t tmo);
void SDH_SetSdClock(uint32_t srcClock, uint32_t busClock);
void SDH_ITConfig(uint32_t SDH_IT_FLAG, BL_Fun_Type NewState);
void SDH_Ctrl_Init(const SDH_Cfg_Type *cfg);
void SDH_Powon(void);
void SDH_SendCommand(SDH_CMD_Cfg_Type *cmd);
void SDH_DisableDMA(void);
void SDH_SetSdClock(uint32_t srcClock, uint32_t busClock);
SDH_Stat_Type SDH_GetCmdResp(SDH_CMD_Cfg_Type *cmd);
uint32_t SDH_ReadDataPort(SDH_Data_Cfg_Type *dataCfg);
SDH_Stat_Type SDH_WaitCommandDone(SDH_CMD_Cfg_Type *cmd);
SDH_Stat_Type SDH_ConfigDataTranfer(SDH_Data_Cfg_Type *dataCfg);
SDH_Stat_Type SDH_TransferDataBlocking(SDH_Data_Cfg_Type *dataCfg, uint8_t enDMA);
SDH_Stat_Type SDH_TransferBlocking(SDH_DMA_Cfg_Type *dmaCfg, SDH_Trans_Cfg_Type *transfer);
SDH_Stat_Type SDH_TransferNonBlocking(SDH_DMA_Cfg_Type *dmaCfg, SDH_Trans_Cfg_Type *transfer);
void SDH_InstallHandleCallback(SDH_Handle_Cfg_Type *handle, const SDH_Trans_Callback_Cfg_Type *callBack, void *userData);
void SDH_EnableDMA(SDH_DMA_Mode_Type dmaMode);
void SDH_EnableStatus(void);
SDH_Stat_Type SDH_ReadDataPortBlock(SDH_Data_Cfg_Type *dataCfg);
uint32_t SDH_WriteDataPort(SDH_Data_Cfg_Type *dataCfg);
SDH_Stat_Type SDH_WriteDataPortBlock(SDH_Data_Cfg_Type *dataCfg);
void SDH_DisableSdClock(void);
void SDH_Deinit(void);
void SDH_GetCapability(SDH_Cap_Cfg_Type *capability);
SDH_Stat_Type SDH_CreateADMA1Descriptor(uint32_t *adma1Entries, uint32_t maxEntries,
                                        const uint32_t *data, uint32_t dataLen, SDH_ADMA_Flag_Type flag);
SDH_Stat_Type SDH_CreateADMA2Descriptor(SDH_ADMA2_Desc_Type *adma2Entries, uint32_t maxEntries,
                                        const uint32_t *data, uint32_t dataLen, SDH_ADMA_Flag_Type flag);
SDH_Stat_Type SDH_SetInternalDmaConfig(SDH_DMA_Cfg_Type *dmaCfg, const uint32_t *data, uint8_t enAutoCmd23);
SDH_Stat_Type SDH_CreateAdmaEntryConfig(SDH_DMA_Cfg_Type *dmaCfg, SDH_Data_Cfg_Type *dataCfg, SDH_ADMA_Flag_Type flag);
/*@} end of group SDH_Public_Functions */

/*@} end of group SDH */

/*@} end of group BL606P_Peripheral_Driver */

#endif /* __BL606P_SDH_H__ */
